# -*- coding: utf-8 -*-

# Volume type translation.
VOL_TYPE_TRANS = {'b': '多头', 's': '空头'}

# Instrument type translation.
INS_TYPE_TRANS = {'cu': '沪铜', 'al': '沪铝', 'zn': '沪锌', 'pb': '沪铅', 'sn': '沪锡', 'ni': '沪镍',
                  'au': '黄金', 'ag': '白银',
                  'rb': '螺纹钢', 'wr': '线材', 'hc': '热轧卷板', 'ss': '不锈钢',
                  'fu': '燃料油', 'bu': '石油沥青', 'ru': '天然橡胶', 'sp': '纸浆', 'sc': '原油', 'nr': '20号胶',
                  'lu': '低硫燃料油', 'bc': '国际铜', 'ao': '氧化铝', 
                  'if': '300沪深', 'ih': '50上证', 'ic': '500中证', 'im': '中证1000',
                  't': '10年期国债', 'tf': '5年期国债', 'ts': '2年期国债', 'tl': '30年期国债',
                }

CONTRACT_UNIT = {'cu': 5, 'al': 5, 'zn': 5, 'pb': 5, 'sn': 1, 'ni': 1,
                 'au': 1000, 'ag': 15,
                 'rb': 10, 'wr': 10, 'hc': 10, 'ss': 5,
                 'fu': 10, 'bu': 10, 'ru': 10, 'sp': 10, 'sc': 1000, 'nr': 10,
                 'lu': 10, 'bc': 5, 'ao': 20, 
                 'if': 300, 'ic': 200, 'im': 200, 'ih': 300, 
                 'ts': 20000, 'tf': 10000, 't': 10000, 'tl': 10000,
                }

MONTH_TRANS = {1: "一月", 2: "二月", 3: "三月", 4: "四月", 5: "五月", 6: "六月",
               7: "七月", 8: "八月", 9: "九月", 10: "十月", 11: "十一月", 12: "十二月"}